import random as ran

rlist = ['알촌', '미파닭', '마루', '브라운돈까스', '마라미방', '더치킨', '동아리식당', '플랜비', '포지타노', '한양식당', '송셰프',
'브라더스테이크', '에비수', '성북동경양식', '유메식당', '젤리팩토리', '은성밥차', '할매순대국', '황산', '청학칡냉면', '오늘도부찌', '신정골',
'조박사 부대찌개', '액션치킨가면', '마시내 탕수육', '탐나는 바지락 칼국수', '더빱집', '앤의식탁', '피자스쿨', '언니네 화덕피자', '천사곱창',
'김가네','은화수','부대통령뚝배기', '북촌손만두', '기봉이 치킨', '홍당무', '찌개찌개', '미스터피자', '육앤샤', '한우궁', '서브웨이',
'브이떡볶이', '떡볶이 명가', '참숯연기', '돼지우리', '장수추어탕', '병천순대', '유가네 닭갈비', '일미 닭갈비', '행복한짬뽕', '밀숲',
'투파인드피터', '정직유부', '김밥큐', '김밥천국', '셀분식', '유원치킨', '취해', '기찬고기', '포나향', '키친모리아', '이삭토스트',
'이서식당', '소담골', '참새방앗간', '도스마스', '카바레식당', '한그릇', '상황 삼계탕', '카페모리아', '예산감자탕', '뉴욕버거', '바비든든',
'홀릭핫도그', '수육국밥']

length = len(rlist)
ran.shuffle(rlist)
print('Press Enter')
for i in range(length):
  a = input()
  if(a=='exit'): break
  print(rlist[i])

